whoweb/payments/tests/cassettes/test_add_card_has_existing_subscription_on_trial.yaml

interactions:
- request:
    body: email=richardsonmichael%40hotmail.com&metadata[djstripe_subscriber]=120
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '71'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - 3c8e8664-21b6-4466-8310-2af9bffd10d5
      Stripe-Version:
      - '2019-09-09'
      User-Agent:
      - Stripe/v1 PythonBindings/2.43.0 dj-stripe/2.2.3 (https://github.com/dj-stripe/dj-stripe)
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_6SBcXEv3Y1RbFk", "request_duration_ms":
        4}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.43.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.0", "platform": "macOS-10.15.2-x86_64-i386-64bit",
        "uname": "Darwin MacBook-Pro-Touch.local 19.2.0 Darwin Kernel Version 19.2.0:
        Sat Nov  9 03:47:04 PST 2019; root:xnu-6153.61.1~20/RELEASE_X86_64 x86_64
        i386", "application": {"name": "dj-stripe", "partner_id": null, "url": "https://github.com/dj-stripe/dj-stripe",
        "version": "2.2.3"}}'
      authorization:
      - DUMMY
    method: POST
    uri: https://api.stripe.com/v1/customers
  response:
    body:
      string: "{\n  \"id\": \"cus_GvhvPDl3WiEZdq\",\n  \"object\": \"customer\",\n\
        \  \"account_balance\": 0,\n  \"address\": null,\n  \"balance\": 0,\n  \"\
        created\": 1584494153,\n  \"currency\": null,\n  \"default_source\": null,\n\
        \  \"delinquent\": false,\n  \"description\": null,\n  \"discount\": null,\n\
        \  \"email\": \"richardsonmichael@hotmail.com\",\n  \"invoice_prefix\": \"\
        9E14F4B3\",\n  \"invoice_settings\": {\n    \"custom_fields\": null,\n   \
        \ \"default_payment_method\": null,\n    \"footer\": null\n  },\n  \"livemode\"\
        : false,\n  \"metadata\": {\n    \"djstripe_subscriber\": \"120\"\n  },\n\
        \  \"name\": null,\n  \"next_invoice_sequence\": 1,\n  \"phone\": null,\n\
        \  \"preferred_locales\": [\n\n  ],\n  \"shipping\": null,\n  \"sources\"\
        : {\n    \"object\": \"list\",\n    \"data\": [\n\n    ],\n    \"has_more\"\
        : false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/cus_GvhvPDl3WiEZdq/sources\"\
        \n  },\n  \"subscriptions\": {\n    \"object\": \"list\",\n    \"data\": [\n\
        \n    ],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\":\
        \ \"/v1/customers/cus_GvhvPDl3WiEZdq/subscriptions\"\n  },\n  \"tax_exempt\"\
        : \"none\",\n  \"tax_ids\": {\n    \"object\": \"list\",\n    \"data\": [\n\
        \n    ],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\":\
        \ \"/v1/customers/cus_GvhvPDl3WiEZdq/tax_ids\"\n  },\n  \"tax_info\": null,\n\
        \  \"tax_info_verification\": null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1207'
      Content-Type:
      - application/json
      Date:
      - Wed, 18 Mar 2020 01:15:53 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - 3c8e8664-21b6-4466-8310-2af9bffd10d5
      original-request:
      - req_TxpX0kXDMArzPx
      request-id:
      - req_TxpX0kXDMArzPx
      stripe-should-retry:
      - 'false'
      stripe-version:
      - '2019-09-09'
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Stripe-Version:
      - '2019-09-09'
      User-Agent:
      - Stripe/v1 PythonBindings/2.43.0 dj-stripe/2.2.3 (https://github.com/dj-stripe/dj-stripe)
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_TxpX0kXDMArzPx", "request_duration_ms":
        600}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.43.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.0", "platform": "macOS-10.15.2-x86_64-i386-64bit",
        "uname": "Darwin MacBook-Pro-Touch.local 19.2.0 Darwin Kernel Version 19.2.0:
        Sat Nov  9 03:47:04 PST 2019; root:xnu-6153.61.1~20/RELEASE_X86_64 x86_64
        i386", "application": {"name": "dj-stripe", "partner_id": null, "url": "https://github.com/dj-stripe/dj-stripe",
        "version": "2.2.3"}}'
      authorization:
      - DUMMY
    method: GET
    uri: https://api.stripe.com/v1/customers/cus_GvhvPDl3WiEZdq?expand%5B0%5D=default_source
  response:
    body:
      string: "{\n  \"id\": \"cus_GvhvPDl3WiEZdq\",\n  \"object\": \"customer\",\n\
        \  \"account_balance\": 0,\n  \"address\": null,\n  \"balance\": 0,\n  \"\
        created\": 1584494153,\n  \"currency\": null,\n  \"default_source\": null,\n\
        \  \"delinquent\": false,\n  \"description\": null,\n  \"discount\": null,\n\
        \  \"email\": \"richardsonmichael@hotmail.com\",\n  \"invoice_prefix\": \"\
        9E14F4B3\",\n  \"invoice_settings\": {\n    \"custom_fields\": null,\n   \
        \ \"default_payment_method\": null,\n    \"footer\": null\n  },\n  \"livemode\"\
        : false,\n  \"metadata\": {\n    \"djstripe_subscriber\": \"120\"\n  },\n\
        \  \"name\": null,\n  \"next_invoice_sequence\": 1,\n  \"phone\": null,\n\
        \  \"preferred_locales\": [\n\n  ],\n  \"shipping\": null,\n  \"sources\"\
        : {\n    \"object\": \"list\",\n    \"data\": [\n\n    ],\n    \"has_more\"\
        : false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/cus_GvhvPDl3WiEZdq/sources\"\
        \n  },\n  \"subscriptions\": {\n    \"object\": \"list\",\n    \"data\": [\n\
        \n    ],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\":\
        \ \"/v1/customers/cus_GvhvPDl3WiEZdq/subscriptions\"\n  },\n  \"tax_exempt\"\
        : \"none\",\n  \"tax_ids\": {\n    \"object\": \"list\",\n    \"data\": [\n\
        \n    ],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\":\
        \ \"/v1/customers/cus_GvhvPDl3WiEZdq/tax_ids\"\n  },\n  \"tax_info\": null,\n\
        \  \"tax_info_verification\": null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1207'
      Content-Type:
      - application/json
      Date:
      - Wed, 18 Mar 2020 01:15:54 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_MNVdLSqxcnbwzD
      stripe-version:
      - '2019-09-09'
    status:
      code: 200
      message: OK
- request:
    body: source=tok_visa
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '15'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - eec4cf74-28ce-435e-8128-f275fc340cca
      Stripe-Version:
      - '2019-09-09'
      User-Agent:
      - Stripe/v1 PythonBindings/2.43.0 dj-stripe/2.2.3 (https://github.com/dj-stripe/dj-stripe)
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_MNVdLSqxcnbwzD", "request_duration_ms":
        130}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.43.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.0", "platform": "macOS-10.15.2-x86_64-i386-64bit",
        "uname": "Darwin MacBook-Pro-Touch.local 19.2.0 Darwin Kernel Version 19.2.0:
        Sat Nov  9 03:47:04 PST 2019; root:xnu-6153.61.1~20/RELEASE_X86_64 x86_64
        i386", "application": {"name": "dj-stripe", "partner_id": null, "url": "https://github.com/dj-stripe/dj-stripe",
        "version": "2.2.3"}}'
      authorization:
      - DUMMY
    method: POST
    uri: https://api.stripe.com/v1/customers/cus_GvhvPDl3WiEZdq/sources
  response:
    body:
      string: "{\n  \"id\": \"card_1GNqViDGSmTJrpHg1dr2VbYG\",\n  \"object\": \"card\"\
        ,\n  \"address_city\": null,\n  \"address_country\": null,\n  \"address_line1\"\
        : null,\n  \"address_line1_check\": null,\n  \"address_line2\": null,\n  \"\
        address_state\": null,\n  \"address_zip\": null,\n  \"address_zip_check\"\
        : null,\n  \"brand\": \"Visa\",\n  \"country\": \"US\",\n  \"customer\": \"\
        cus_GvhvPDl3WiEZdq\",\n  \"cvc_check\": null,\n  \"dynamic_last4\": null,\n\
        \  \"exp_month\": 3,\n  \"exp_year\": 2021,\n  \"fingerprint\": \"JBQUMWEqhLPrdmkK\"\
        ,\n  \"funding\": \"credit\",\n  \"last4\": \"4242\",\n  \"metadata\": {\n\
        \  },\n  \"name\": null,\n  \"tokenization_method\": null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '578'
      Content-Type:
      - application/json
      Date:
      - Wed, 18 Mar 2020 01:15:54 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - eec4cf74-28ce-435e-8128-f275fc340cca
      original-request:
      - req_KjzadOzcLwkteP
      request-id:
      - req_KjzadOzcLwkteP
      stripe-should-retry:
      - 'false'
      stripe-version:
      - '2019-09-09'
    status:
      code: 200
      message: OK
- request:
    body: default_source=card_1GNqViDGSmTJrpHg1dr2VbYG
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '44'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - e9455633-a08b-4509-b77b-d7a5e5548fcf
      Stripe-Version:
      - '2019-09-09'
      User-Agent:
      - Stripe/v1 PythonBindings/2.43.0 dj-stripe/2.2.3 (https://github.com/dj-stripe/dj-stripe)
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_KjzadOzcLwkteP", "request_duration_ms":
        331}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.43.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.0", "platform": "macOS-10.15.2-x86_64-i386-64bit",
        "uname": "Darwin MacBook-Pro-Touch.local 19.2.0 Darwin Kernel Version 19.2.0:
        Sat Nov  9 03:47:04 PST 2019; root:xnu-6153.61.1~20/RELEASE_X86_64 x86_64
        i386", "application": {"name": "dj-stripe", "partner_id": null, "url": "https://github.com/dj-stripe/dj-stripe",
        "version": "2.2.3"}}'
      authorization:
      - DUMMY
    method: POST
    uri: https://api.stripe.com/v1/customers/cus_GvhvPDl3WiEZdq
  response:
    body:
      string: "{\n  \"id\": \"cus_GvhvPDl3WiEZdq\",\n  \"object\": \"customer\",\n\
        \  \"account_balance\": 0,\n  \"address\": null,\n  \"balance\": 0,\n  \"\
        created\": 1584494153,\n  \"currency\": null,\n  \"default_source\": \"card_1GNqViDGSmTJrpHg1dr2VbYG\"\
        ,\n  \"delinquent\": false,\n  \"description\": null,\n  \"discount\": null,\n\
        \  \"email\": \"richardsonmichael@hotmail.com\",\n  \"invoice_prefix\": \"\
        9E14F4B3\",\n  \"invoice_settings\": {\n    \"custom_fields\": null,\n   \
        \ \"default_payment_method\": null,\n    \"footer\": null\n  },\n  \"livemode\"\
        : false,\n  \"metadata\": {\n    \"djstripe_subscriber\": \"120\"\n  },\n\
        \  \"name\": null,\n  \"next_invoice_sequence\": 1,\n  \"phone\": null,\n\
        \  \"preferred_locales\": [\n\n  ],\n  \"shipping\": null,\n  \"sources\"\
        : {\n    \"object\": \"list\",\n    \"data\": [\n      {\n        \"id\":\
        \ \"card_1GNqViDGSmTJrpHg1dr2VbYG\",\n        \"object\": \"card\",\n    \
        \    \"address_city\": null,\n        \"address_country\": null,\n       \
        \ \"address_line1\": null,\n        \"address_line1_check\": null,\n     \
        \   \"address_line2\": null,\n        \"address_state\": null,\n        \"\
        address_zip\": null,\n        \"address_zip_check\": null,\n        \"brand\"\
        : \"Visa\",\n        \"country\": \"US\",\n        \"customer\": \"cus_GvhvPDl3WiEZdq\"\
        ,\n        \"cvc_check\": null,\n        \"dynamic_last4\": null,\n      \
        \  \"exp_month\": 3,\n        \"exp_year\": 2021,\n        \"fingerprint\"\
        : \"JBQUMWEqhLPrdmkK\",\n        \"funding\": \"credit\",\n        \"last4\"\
        : \"4242\",\n        \"metadata\": {\n        },\n        \"name\": null,\n\
        \        \"tokenization_method\": null\n      }\n    ],\n    \"has_more\"\
        : false,\n    \"total_count\": 1,\n    \"url\": \"/v1/customers/cus_GvhvPDl3WiEZdq/sources\"\
        \n  },\n  \"subscriptions\": {\n    \"object\": \"list\",\n    \"data\": [\n\
        \n    ],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\":\
        \ \"/v1/customers/cus_GvhvPDl3WiEZdq/subscriptions\"\n  },\n  \"tax_exempt\"\
        : \"none\",\n  \"tax_ids\": {\n    \"object\": \"list\",\n    \"data\": [\n\
        \n    ],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\":\
        \ \"/v1/customers/cus_GvhvPDl3WiEZdq/tax_ids\"\n  },\n  \"tax_info\": null,\n\
        \  \"tax_info_verification\": null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1967'
      Content-Type:
      - application/json
      Date:
      - Wed, 18 Mar 2020 01:15:55 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - e9455633-a08b-4509-b77b-d7a5e5548fcf
      original-request:
      - req_L6lKg9SLLpbBeb
      request-id:
      - req_L6lKg9SLLpbBeb
      stripe-should-retry:
      - 'false'
      stripe-version:
      - '2019-09-09'
    status:
      code: 200
      message: OK
version: 1
