whoweb/payments/tests/cassettes/test_add_card_has_existing_subscription_past_due.yaml

interactions:
- request:
    body: email=danielyoung%40harper-allen.com&metadata[djstripe_subscriber]=121
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '70'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - 7d15a7f1-b67e-4d05-b4ed-b1935d4cde56
      Stripe-Version:
      - '2019-09-09'
      User-Agent:
      - Stripe/v1 PythonBindings/2.43.0 dj-stripe/2.2.3 (https://github.com/dj-stripe/dj-stripe)
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_L6lKg9SLLpbBeb", "request_duration_ms":
        4}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.43.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.0", "platform": "macOS-10.15.2-x86_64-i386-64bit",
        "uname": "Darwin MacBook-Pro-Touch.local 19.2.0 Darwin Kernel Version 19.2.0:
        Sat Nov  9 03:47:04 PST 2019; root:xnu-6153.61.1~20/RELEASE_X86_64 x86_64
        i386", "application": {"name": "dj-stripe", "partner_id": null, "url": "https://github.com/dj-stripe/dj-stripe",
        "version": "2.2.3"}}'
      authorization:
      - DUMMY
    method: POST
    uri: https://api.stripe.com/v1/customers
  response:
    body:
      string: "{\n  \"id\": \"cus_GviiXK8ez29wGY\",\n  \"object\": \"customer\",\n
        \ \"account_balance\": 0,\n  \"address\": null,\n  \"balance\": 0,\n  \"created\":
        1584497102,\n  \"currency\": null,\n  \"default_source\": null,\n  \"delinquent\":
        false,\n  \"description\": null,\n  \"discount\": null,\n  \"email\": \"danielyoung@harper-allen.com\",\n
        \ \"invoice_prefix\": \"20578EA5\",\n  \"invoice_settings\": {\n    \"custom_fields\":
        null,\n    \"default_payment_method\": null,\n    \"footer\": null\n  },\n
        \ \"livemode\": false,\n  \"metadata\": {\n    \"djstripe_subscriber\": \"121\"\n
        \ },\n  \"name\": null,\n  \"next_invoice_sequence\": 1,\n  \"phone\": null,\n
        \ \"preferred_locales\": [\n\n  ],\n  \"shipping\": null,\n  \"sources\":
        {\n    \"object\": \"list\",\n    \"data\": [\n\n    ],\n    \"has_more\":
        false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/cus_GviiXK8ez29wGY/sources\"\n
        \ },\n  \"subscriptions\": {\n    \"object\": \"list\",\n    \"data\": [\n\n
        \   ],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/cus_GviiXK8ez29wGY/subscriptions\"\n
        \ },\n  \"tax_exempt\": \"none\",\n  \"tax_ids\": {\n    \"object\": \"list\",\n
        \   \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\":
        0,\n    \"url\": \"/v1/customers/cus_GviiXK8ez29wGY/tax_ids\"\n  },\n  \"tax_info\":
        null,\n  \"tax_info_verification\": null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1206'
      Content-Type:
      - application/json
      Date:
      - Wed, 18 Mar 2020 02:05:02 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - 7d15a7f1-b67e-4d05-b4ed-b1935d4cde56
      original-request:
      - req_7KwdPfMzBKytUI
      request-id:
      - req_7KwdPfMzBKytUI
      stripe-should-retry:
      - 'false'
      stripe-version:
      - '2019-09-09'
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Stripe-Version:
      - '2019-09-09'
      User-Agent:
      - Stripe/v1 PythonBindings/2.43.0 dj-stripe/2.2.3 (https://github.com/dj-stripe/dj-stripe)
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_7KwdPfMzBKytUI", "request_duration_ms":
        362}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.43.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.0", "platform": "macOS-10.15.2-x86_64-i386-64bit",
        "uname": "Darwin MacBook-Pro-Touch.local 19.2.0 Darwin Kernel Version 19.2.0:
        Sat Nov  9 03:47:04 PST 2019; root:xnu-6153.61.1~20/RELEASE_X86_64 x86_64
        i386", "application": {"name": "dj-stripe", "partner_id": null, "url": "https://github.com/dj-stripe/dj-stripe",
        "version": "2.2.3"}}'
      authorization:
      - DUMMY
    method: GET
    uri: https://api.stripe.com/v1/customers/cus_GviiXK8ez29wGY?expand%5B0%5D=default_source
  response:
    body:
      string: "{\n  \"id\": \"cus_GviiXK8ez29wGY\",\n  \"object\": \"customer\",\n
        \ \"account_balance\": 0,\n  \"address\": null,\n  \"balance\": 0,\n  \"created\":
        1584497102,\n  \"currency\": null,\n  \"default_source\": null,\n  \"delinquent\":
        false,\n  \"description\": null,\n  \"discount\": null,\n  \"email\": \"danielyoung@harper-allen.com\",\n
        \ \"invoice_prefix\": \"20578EA5\",\n  \"invoice_settings\": {\n    \"custom_fields\":
        null,\n    \"default_payment_method\": null,\n    \"footer\": null\n  },\n
        \ \"livemode\": false,\n  \"metadata\": {\n    \"djstripe_subscriber\": \"121\"\n
        \ },\n  \"name\": null,\n  \"next_invoice_sequence\": 1,\n  \"phone\": null,\n
        \ \"preferred_locales\": [\n\n  ],\n  \"shipping\": null,\n  \"sources\":
        {\n    \"object\": \"list\",\n    \"data\": [\n\n    ],\n    \"has_more\":
        false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/cus_GviiXK8ez29wGY/sources\"\n
        \ },\n  \"subscriptions\": {\n    \"object\": \"list\",\n    \"data\": [\n\n
        \   ],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/cus_GviiXK8ez29wGY/subscriptions\"\n
        \ },\n  \"tax_exempt\": \"none\",\n  \"tax_ids\": {\n    \"object\": \"list\",\n
        \   \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\":
        0,\n    \"url\": \"/v1/customers/cus_GviiXK8ez29wGY/tax_ids\"\n  },\n  \"tax_info\":
        null,\n  \"tax_info_verification\": null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1206'
      Content-Type:
      - application/json
      Date:
      - Wed, 18 Mar 2020 02:05:02 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_rMAdmpYmNXLafa
      stripe-version:
      - '2019-09-09'
    status:
      code: 200
      message: OK
- request:
    body: source=tok_visa
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '15'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - 12945919-4482-42ef-a87d-15be46f489dc
      Stripe-Version:
      - '2019-09-09'
      User-Agent:
      - Stripe/v1 PythonBindings/2.43.0 dj-stripe/2.2.3 (https://github.com/dj-stripe/dj-stripe)
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_rMAdmpYmNXLafa", "request_duration_ms":
        134}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.43.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.0", "platform": "macOS-10.15.2-x86_64-i386-64bit",
        "uname": "Darwin MacBook-Pro-Touch.local 19.2.0 Darwin Kernel Version 19.2.0:
        Sat Nov  9 03:47:04 PST 2019; root:xnu-6153.61.1~20/RELEASE_X86_64 x86_64
        i386", "application": {"name": "dj-stripe", "partner_id": null, "url": "https://github.com/dj-stripe/dj-stripe",
        "version": "2.2.3"}}'
      authorization:
      - DUMMY
    method: POST
    uri: https://api.stripe.com/v1/customers/cus_GviiXK8ez29wGY/sources
  response:
    body:
      string: "{\n  \"id\": \"card_1GNrHGDGSmTJrpHgXl621MGq\",\n  \"object\": \"card\",\n
        \ \"address_city\": null,\n  \"address_country\": null,\n  \"address_line1\":
        null,\n  \"address_line1_check\": null,\n  \"address_line2\": null,\n  \"address_state\":
        null,\n  \"address_zip\": null,\n  \"address_zip_check\": null,\n  \"brand\":
        \"Visa\",\n  \"country\": \"US\",\n  \"customer\": \"cus_GviiXK8ez29wGY\",\n
        \ \"cvc_check\": null,\n  \"dynamic_last4\": null,\n  \"exp_month\": 3,\n
        \ \"exp_year\": 2021,\n  \"fingerprint\": \"JBQUMWEqhLPrdmkK\",\n  \"funding\":
        \"credit\",\n  \"last4\": \"4242\",\n  \"metadata\": {\n  },\n  \"name\":
        null,\n  \"tokenization_method\": null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '578'
      Content-Type:
      - application/json
      Date:
      - Wed, 18 Mar 2020 02:05:03 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - 12945919-4482-42ef-a87d-15be46f489dc
      original-request:
      - req_O8GUXI7rVZ2ZpX
      request-id:
      - req_O8GUXI7rVZ2ZpX
      stripe-should-retry:
      - 'false'
      stripe-version:
      - '2019-09-09'
    status:
      code: 200
      message: OK
- request:
    body: default_source=card_1GNrHGDGSmTJrpHgXl621MGq
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '44'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - 3f93c8c3-fb42-441b-bd92-3c6dee4af820
      Stripe-Version:
      - '2019-09-09'
      User-Agent:
      - Stripe/v1 PythonBindings/2.43.0 dj-stripe/2.2.3 (https://github.com/dj-stripe/dj-stripe)
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_O8GUXI7rVZ2ZpX", "request_duration_ms":
        635}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.43.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.0", "platform": "macOS-10.15.2-x86_64-i386-64bit",
        "uname": "Darwin MacBook-Pro-Touch.local 19.2.0 Darwin Kernel Version 19.2.0:
        Sat Nov  9 03:47:04 PST 2019; root:xnu-6153.61.1~20/RELEASE_X86_64 x86_64
        i386", "application": {"name": "dj-stripe", "partner_id": null, "url": "https://github.com/dj-stripe/dj-stripe",
        "version": "2.2.3"}}'
      authorization:
      - DUMMY
    method: POST
    uri: https://api.stripe.com/v1/customers/cus_GviiXK8ez29wGY
  response:
    body:
      string: "{\n  \"id\": \"cus_GviiXK8ez29wGY\",\n  \"object\": \"customer\",\n
        \ \"account_balance\": 0,\n  \"address\": null,\n  \"balance\": 0,\n  \"created\":
        1584497102,\n  \"currency\": null,\n  \"default_source\": \"card_1GNrHGDGSmTJrpHgXl621MGq\",\n
        \ \"delinquent\": false,\n  \"description\": null,\n  \"discount\": null,\n
        \ \"email\": \"danielyoung@harper-allen.com\",\n  \"invoice_prefix\": \"20578EA5\",\n
        \ \"invoice_settings\": {\n    \"custom_fields\": null,\n    \"default_payment_method\":
        null,\n    \"footer\": null\n  },\n  \"livemode\": false,\n  \"metadata\":
        {\n    \"djstripe_subscriber\": \"121\"\n  },\n  \"name\": null,\n  \"next_invoice_sequence\":
        1,\n  \"phone\": null,\n  \"preferred_locales\": [\n\n  ],\n  \"shipping\":
        null,\n  \"sources\": {\n    \"object\": \"list\",\n    \"data\": [\n      {\n
        \       \"id\": \"card_1GNrHGDGSmTJrpHgXl621MGq\",\n        \"object\": \"card\",\n
        \       \"address_city\": null,\n        \"address_country\": null,\n        \"address_line1\":
        null,\n        \"address_line1_check\": null,\n        \"address_line2\":
        null,\n        \"address_state\": null,\n        \"address_zip\": null,\n
        \       \"address_zip_check\": null,\n        \"brand\": \"Visa\",\n        \"country\":
        \"US\",\n        \"customer\": \"cus_GviiXK8ez29wGY\",\n        \"cvc_check\":
        null,\n        \"dynamic_last4\": null,\n        \"exp_month\": 3,\n        \"exp_year\":
        2021,\n        \"fingerprint\": \"JBQUMWEqhLPrdmkK\",\n        \"funding\":
        \"credit\",\n        \"last4\": \"4242\",\n        \"metadata\": {\n        },\n
        \       \"name\": null,\n        \"tokenization_method\": null\n      }\n
        \   ],\n    \"has_more\": false,\n    \"total_count\": 1,\n    \"url\": \"/v1/customers/cus_GviiXK8ez29wGY/sources\"\n
        \ },\n  \"subscriptions\": {\n    \"object\": \"list\",\n    \"data\": [\n\n
        \   ],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/cus_GviiXK8ez29wGY/subscriptions\"\n
        \ },\n  \"tax_exempt\": \"none\",\n  \"tax_ids\": {\n    \"object\": \"list\",\n
        \   \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\":
        0,\n    \"url\": \"/v1/customers/cus_GviiXK8ez29wGY/tax_ids\"\n  },\n  \"tax_info\":
        null,\n  \"tax_info_verification\": null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1966'
      Content-Type:
      - application/json
      Date:
      - Wed, 18 Mar 2020 02:05:03 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - 3f93c8c3-fb42-441b-bd92-3c6dee4af820
      original-request:
      - req_kDPgnkRkZ2MFis
      request-id:
      - req_kDPgnkRkZ2MFis
      stripe-should-retry:
      - 'false'
      stripe-version:
      - '2019-09-09'
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Stripe-Version:
      - '2020-08-27'
      User-Agent:
      - Stripe/v1 PythonBindings/2.56.0 dj-stripe/2.4.3 (https://github.com/dj-stripe/dj-stripe)
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_7KwdPfMzBKytUI", "request_duration_ms":
        514}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.56.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.0", "platform": "macOS-10.16-x86_64-i386-64bit",
        "uname": "Darwin MacBook-Pro-Touch.local 20.3.0 Darwin Kernel Version 20.3.0:
        Thu Jan 21 00:07:06 PST 2021; root:xnu-7195.81.3~1/RELEASE_X86_64 x86_64 i386",
        "application": {"name": "dj-stripe", "partner_id": null, "url": "https://github.com/dj-stripe/dj-stripe",
        "version": "2.4.3"}}'
      authorization:
      - DUMMY
    method: GET
    uri: https://api.stripe.com/v1/customers/cus_GviiXK8ez29wGY?expand%5B0%5D=default_source&expand%5B1%5D=sources
  response:
    body:
      string: "{\n  \"id\": \"cus_GviiXK8ez29wGY\",\n  \"object\": \"customer\",\n
        \ \"address\": null,\n  \"balance\": 0,\n  \"created\": 1584497102,\n  \"currency\":
        null,\n  \"default_source\": {\n    \"id\": \"card_1GNrHGDGSmTJrpHgXl621MGq\",\n
        \   \"object\": \"card\",\n    \"address_city\": null,\n    \"address_country\":
        null,\n    \"address_line1\": null,\n    \"address_line1_check\": null,\n
        \   \"address_line2\": null,\n    \"address_state\": null,\n    \"address_zip\":
        null,\n    \"address_zip_check\": null,\n    \"brand\": \"Visa\",\n    \"country\":
        \"US\",\n    \"customer\": \"cus_GviiXK8ez29wGY\",\n    \"cvc_check\": null,\n
        \   \"dynamic_last4\": null,\n    \"exp_month\": 3,\n    \"exp_year\": 2021,\n
        \   \"fingerprint\": \"JBQUMWEqhLPrdmkK\",\n    \"funding\": \"credit\",\n
        \   \"last4\": \"4242\",\n    \"metadata\": {\n    },\n    \"name\": null,\n
        \   \"tokenization_method\": null\n  },\n  \"delinquent\": false,\n  \"description\":
        null,\n  \"discount\": null,\n  \"email\": \"danielyoung@harper-allen.com\",\n
        \ \"invoice_prefix\": \"20578EA5\",\n  \"invoice_settings\": {\n    \"custom_fields\":
        null,\n    \"default_payment_method\": null,\n    \"footer\": null\n  },\n
        \ \"livemode\": false,\n  \"metadata\": {\n    \"djstripe_subscriber\": \"121\"\n
        \ },\n  \"name\": null,\n  \"next_invoice_sequence\": 1,\n  \"phone\": null,\n
        \ \"preferred_locales\": [\n\n  ],\n  \"shipping\": null,\n  \"sources\":
        {\n    \"object\": \"list\",\n    \"data\": [\n      {\n        \"id\": \"card_1GNrHGDGSmTJrpHgXl621MGq\",\n
        \       \"object\": \"card\",\n        \"address_city\": null,\n        \"address_country\":
        null,\n        \"address_line1\": null,\n        \"address_line1_check\":
        null,\n        \"address_line2\": null,\n        \"address_state\": null,\n
        \       \"address_zip\": null,\n        \"address_zip_check\": null,\n        \"brand\":
        \"Visa\",\n        \"country\": \"US\",\n        \"customer\": \"cus_GviiXK8ez29wGY\",\n
        \       \"cvc_check\": null,\n        \"dynamic_last4\": null,\n        \"exp_month\":
        3,\n        \"exp_year\": 2021,\n        \"fingerprint\": \"JBQUMWEqhLPrdmkK\",\n
        \       \"funding\": \"credit\",\n        \"last4\": \"4242\",\n        \"metadata\":
        {\n        },\n        \"name\": null,\n        \"tokenization_method\": null\n
        \     }\n    ],\n    \"has_more\": false,\n    \"total_count\": 1,\n    \"url\":
        \"/v1/customers/cus_GviiXK8ez29wGY/sources\"\n  },\n  \"tax_exempt\": \"none\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '2147'
      Content-Type:
      - application/json
      Date:
      - Wed, 17 Mar 2021 17:56:37 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_O8lACOhq2wcABg
      stripe-version:
      - '2020-08-27'
      x-stripe-c-cost:
      - '0'
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Stripe-Version:
      - '2020-08-27'
      User-Agent:
      - Stripe/v1 PythonBindings/2.56.0 dj-stripe/2.4.3 (https://github.com/dj-stripe/dj-stripe)
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_kDPgnkRkZ2MFis", "request_duration_ms":
        5}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.56.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.0", "platform": "macOS-10.16-x86_64-i386-64bit",
        "uname": "Darwin MacBook-Pro-Touch.local 20.3.0 Darwin Kernel Version 20.3.0:
        Thu Jan 21 00:07:06 PST 2021; root:xnu-7195.81.3~1/RELEASE_X86_64 x86_64 i386",
        "application": {"name": "dj-stripe", "partner_id": null, "url": "https://github.com/dj-stripe/dj-stripe",
        "version": "2.4.3"}}'
      authorization:
      - DUMMY
    method: GET
    uri: https://api.stripe.com/v1/account
  response:
    body:
      string: "{\n  \"id\": \"acct_19BvoLDGSmTJrpHg\",\n  \"object\": \"account\",\n
        \ \"capabilities\": {\n    \"afterpay_clearpay_payments\": \"inactive\",\n
        \   \"bancontact_payments\": \"active\",\n    \"eps_payments\": \"active\",\n
        \   \"giropay_payments\": \"active\",\n    \"ideal_payments\": \"active\",\n
        \   \"legacy_payments\": \"active\",\n    \"p24_payments\": \"active\",\n
        \   \"sepa_debit_payments\": \"active\",\n    \"sofort_payments\": \"active\"\n
        \ },\n  \"charges_enabled\": true,\n  \"country\": \"US\",\n  \"default_currency\":
        \"usd\",\n  \"details_submitted\": true,\n  \"payouts_enabled\": true,\n  \"settings\":
        {\n    \"bacs_debit_payments\": {\n    },\n    \"branding\": {\n      \"icon\":
        \"https://s3.amazonaws.com/stripe-uploads/acct_19BvoLDGSmTJrpHgmerchant-icon-1490639985626-128x128%20White%20on%20Blue.png\",\n
        \     \"logo\": \"file_1Gdg59DGSmTJrpHgAxUaZDIV\",\n      \"primary_color\":
        \"#525f7f\",\n      \"secondary_color\": \"#0074d4\"\n    },\n    \"card_payments\":
        {\n      \"statement_descriptor_prefix\": null\n    },\n    \"dashboard\":
        {\n      \"display_name\": \"WhoKnows\",\n      \"timezone\": \"America/Los_Angeles\"\n
        \   },\n    \"payments\": {\n      \"statement_descriptor\": \"WHOKNOWS\",\n
        \     \"statement_descriptor_kana\": null,\n      \"statement_descriptor_kanji\":
        null\n    },\n    \"payouts\": {\n      \"debit_negative_balances\": true,\n
        \     \"schedule\": {\n        \"delay_days\": 2,\n        \"interval\": \"daily\"\n
        \     },\n      \"statement_descriptor\": null\n    },\n    \"sepa_debit_payments\":
        {\n    }\n  },\n  \"type\": \"standard\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1420'
      Content-Type:
      - application/json
      Date:
      - Wed, 17 Mar 2021 17:56:37 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_AekgobudIIPsCr
      stripe-version:
      - '2020-08-27'
      x-stripe-c-cost:
      - '1'
    status:
      code: 200
      message: OK
version: 1
